{
  "format": "graph-model",
  "generatedBy": "2.8.0",
  "convertedBy": "TensorFlow.js Converter v3.15.0",
  "signature": {
    "inputs": {
      "sequential_1_input": {
        "name": "sequential_1_input:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "180" }, { "size": "180" }, { "size": "3" }] }
      }
    },
    "outputs": {
      "dense_3": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "120" }] }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast/x",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_FLOAT" }, "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast_1/x",
        "op": "Const",
        "attr": { "dtype": { "type": "DT_FLOAT" }, "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_3/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "3" }, { "size": "16" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "16" }] } } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_4/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "16" }, { "size": "32" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_4/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "32" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_5/Conv2D/ReadVariableOp",
        "op": "Const",
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "3" }, { "size": "3" }, { "size": "32" }, { "size": "64" }] }
            }
          }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_5/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "64" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/flatten_1/Const",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": { "dim": [{ "size": "2" }] } } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "30976" }, { "size": "128" }] } }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "128" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "128" }, { "size": "120" }] } }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": { "dim": [{ "size": "120" }] } } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "sequential_1_input",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }, { "size": "180" }, { "size": "180" }, { "size": "3" }] } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_2/mul",
        "op": "Mul",
        "input": ["sequential_1_input", "StatefulPartitionedCall/sequential_2/rescaling_2/Cast/x"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/rescaling_2/add",
        "op": "AddV2",
        "input": [
          "StatefulPartitionedCall/sequential_2/rescaling_2/mul",
          "StatefulPartitionedCall/sequential_2/rescaling_2/Cast_1/x"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_3/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_2/rescaling_2/add",
          "StatefulPartitionedCall/sequential_2/conv2d_3/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "use_cudnn_on_gpu": { "b": true },
          "data_format": { "s": "TkhXQw==" },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" },
          "epsilon": { "f": 0.0 },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "padding": { "s": "U0FNRQ==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/max_pooling2d_3/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_2/conv2d_3/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_4/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_2/max_pooling2d_3/MaxPool",
          "StatefulPartitionedCall/sequential_2/conv2d_4/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/conv2d_4/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "padding": { "s": "U0FNRQ==" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "use_cudnn_on_gpu": { "b": true },
          "explicit_paddings": { "list": {} },
          "T": { "type": "DT_FLOAT" },
          "num_args": { "i": "1" },
          "data_format": { "s": "TkhXQw==" },
          "epsilon": { "f": 0.0 }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/max_pooling2d_4/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_2/conv2d_4/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "T": { "type": "DT_FLOAT" },
          "data_format": { "s": "TkhXQw==" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/conv2d_5/Relu",
        "op": "_FusedConv2D",
        "input": [
          "StatefulPartitionedCall/sequential_2/max_pooling2d_4/MaxPool",
          "StatefulPartitionedCall/sequential_2/conv2d_5/Conv2D/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/conv2d_5/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "use_cudnn_on_gpu": { "b": true },
          "epsilon": { "f": 0.0 },
          "num_args": { "i": "1" },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } },
          "strides": { "list": { "i": ["1", "1", "1", "1"] } },
          "explicit_paddings": { "list": {} },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "padding": { "s": "U0FNRQ==" }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/max_pooling2d_5/MaxPool",
        "op": "MaxPool",
        "input": ["StatefulPartitionedCall/sequential_2/conv2d_5/Relu"],
        "attr": {
          "padding": { "s": "VkFMSUQ=" },
          "explicit_paddings": { "list": {} },
          "ksize": { "list": { "i": ["1", "2", "2", "1"] } },
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/flatten_1/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/sequential_2/max_pooling2d_5/MaxPool",
          "StatefulPartitionedCall/sequential_2/flatten_1/Const"
        ],
        "attr": { "T": { "type": "DT_FLOAT" }, "Tshape": { "type": "DT_INT32" } }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_2/Relu",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_2/flatten_1/Reshape",
          "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "transpose_b": { "b": false },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd",
        "op": "_FusedMatMul",
        "input": [
          "StatefulPartitionedCall/sequential_2/dense_2/Relu",
          "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA=="] } },
          "num_args": { "i": "1" },
          "transpose_b": { "b": false },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" },
          "transpose_a": { "b": false }
        }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": ["StatefulPartitionedCall/sequential_2/dense_3/BiasAdd"],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 987 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"],
      "weights": [
        { "name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast/x", "shape": [], "dtype": "float32" },
        { "name": "StatefulPartitionedCall/sequential_2/rescaling_2/Cast_1/x", "shape": [], "dtype": "float32" },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_3/Conv2D/ReadVariableOp",
          "shape": [3, 3, 3, 16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_3/BiasAdd/ReadVariableOp",
          "shape": [16],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_4/Conv2D/ReadVariableOp",
          "shape": [3, 3, 16, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_4/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_5/Conv2D/ReadVariableOp",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/conv2d_5/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        { "name": "StatefulPartitionedCall/sequential_2/flatten_1/Const", "shape": [2], "dtype": "int32" },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp",
          "shape": [30976, 128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_3/MatMul/ReadVariableOp",
          "shape": [128, 120],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/sequential_2/dense_3/BiasAdd/ReadVariableOp",
          "shape": [120],
          "dtype": "float32"
        }
      ]
    }
  ]
}
